In [2]:
import pandas as panda

print(panda.__version__)

usersData = {
    "name": ["mano", "uma", "krishna", "vasantha"],
    "age": [20, 21, 22, 23],
    "gender": ["male", "female", "male", "male"],
    "salary": [10000, 20000, 30000, 40000],
    "city": ["bangalore", "chennai", "covai", "trichy"]
}

dataFrame_userData = panda.DataFrame(usersData)
dataFrame_userData.index = ["alpha", "beta", "gamma", "delta"]


filter_age = dataFrame_userData["age"] > 22
sorted_age = dataFrame_userData.sort_values(by="age", ascending=False)

grouping = sorted_age.groupby("gender").agg({"salary": "sum", "age": "mean"})

grouping_pivot = dataFrame_userData.pivot_table(index="name", values="salary", aggfunc="sum")

print(usersData, "\n", dataFrame_userData)

print("filter Data set")
print(dataFrame_userData[filter_age])

print("\n sorted Data set")
print(sorted_age)

print("\n grouping Data set")
print(grouping)

print("\n grouping Pivot table")
print(grouping_pivot)

print("\n grouping Data set")
print(grouping)
grouping_pivot

2.3.3
{'name': ['mano', 'uma', 'krishna', 'vasantha'], 'age': [20, 21, 22, 23], 'gender': ['male', 'female', 'male', 'male'], 'salary': [10000, 20000, 30000, 40000], 'city': ['bangalore', 'chennai', 'covai', 'trichy']}
            name  age  gender  salary       city
alpha      mano   20    male   10000  bangalore
beta        uma   21  female   20000    chennai
gamma   krishna   22    male   30000      covai
delta  vasantha   23    male   40000     trichy
filter Data set
           name  age gender  salary    city
delta  vasantha   23   male   40000  trichy

 sorted Data set
           name  age  gender  salary       city
delta  vasantha   23    male   40000     trichy
gamma   krishna   22    male   30000      covai
beta        uma   21  female   20000    chennai
alpha      mano   20    male   10000  bangalore

 grouping Data set
        salary        age
gender
female   20000  21.000000
male     80000  21.666667

 grouping Pivot table
          salary
name
krishna    30000
mano       10000
uma        20000
vasantha   40000

 grouping Data set
        salary        age
gender
female   20000  21.000000
male     80000  21.666667

          salary
name
krishna    30000
mano       10000
uma        20000
vasantha   40000

In [3]:
titanicDataSet = panda.read_csv("Titanic-Dataset.csv")

titanicDataSet

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
# find duplicates in the dataset row by row
titanicDataSet.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Length: 891, dtype: bool

In [ ]:
# find duplicates in the dataset whole
titanicDataSet.duplicated().sum()

np.int64(0)

In [8]:
# find data types for each rows
titanicDataSet.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## What is Distribution? (Simple Meaning)

Distribution describes **how values in a dataset are spread** or distributed.

# Types of Distribution

Distribution describes **how data values are spread or arranged** in a dataset.

---

## 1. Normal Distribution (Gaussian)

**Description:**
- Data is symmetrically distributed around the mean
- Bell-shaped curve

**Key Points:**
- Mean = Median = Mode
- No skewness

**Examples:**
- Student heights
- Exam scores

---

## 2. Uniform Distribution

**Description:**
- All values occur with equal frequency

**Key Points:**
- Flat distribution
- No peaks

**Examples:**
- Dice roll outcomes
- Random number generation

---

## 3. Right-Skewed Distribution (Positive Skew)

**Description:**
- Most values are small
- Few very large values

**Key Points:**
- Long tail on the right
- Mean > Median

**Examples:**
- Salaries
- House prices

---

## 4. Left-Skewed Distribution (Negative Skew)

**Description:**
- Most values are large
- Few very small values

**Key Points:**
- Long tail on the left
- Mean < Median

**Examples:**
- Exam scores where most students score high

---

## 5. Bimodal Distribution

**Description:**
- Data has two peaks

**Key Points:**
- Two dominant value ranges

**Examples:**
- Heights of men and women combined
- Morning and evening traffic

---

## 6. Multimodal Distribution

**Description:**
- Data has more than two peaks

**Examples:**
- Website traffic across multiple time zones

---

## 7. Exponential Distribution

**Description:**
- Many small values
- Few large values

**Examples:**
- Time between customer arrivals
- Server request gaps

---

## 8. Log-Normal Distribution

**Description:**
- Log of the data follows a normal distribution
- Data is right-skewed

**Examples:**
- Income
- Stock prices
- File sizes

---

## 9. Discrete Distribution

**Description:**
- Data consists of countable values

**Examples:**
- Number of users
- Number of clicks

---

## 10. Continuous Distribution

**Description:**
- Data can take any value within a range

**Examples:**
- Temperature
- Weight
- Time

---

## Summary Table

| Distribution Type | Example |
|------------------|--------|
| Normal | Heights |
| Uniform | Dice |
| Right-Skewed | Salary |
| Left-Skewed | Exam scores |
| Bimodal | Gender heights |
| Exponential | Arrival times |
| Log-Normal | Income |
| Discrete | Click counts |
| Continuous | Temperature |

---

## One-Line Definition

> **Distribution shows how data values are spread and patterned within a dataset.**

In [14]:
columns_dataset= titanicDataSet.columns

columnsList = list(columns_dataset)

print(columns_dataset, "\n",columnsList)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
 ['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']

In [ ]:
# finding distribution of the data each columns 
distribution = titanicDataSet["Survived"].skew()

# if distribution is zero then it is normal distribution
# if distribution is positive then it is right skewed
# if distribution is negative then it is left skewed

print(distribution)

0.4785234382949897

In [20]:
for index in range(len(columnsList)):
    col = columnsList[index]

    if titanicDataSet[col].dtype != "object":
        print(f"{col} distribution (skewness): {titanicDataSet[col].skew()}")
    else:
        print(f"{col} data type is {titanicDataSet[col].dtype}")

PassengerId distribution (skewness): 0.0
Survived distribution (skewness): 0.4785234382949897
Pclass distribution (skewness): -0.6305479068752845
Name data type is object
Sex data type is object
Age distribution (skewness): 0.38910778230082704
SibSp distribution (skewness): 3.6953517271630565
Parch distribution (skewness): 2.7491170471010933
Ticket data type is object
Fare distribution (skewness): 4.787316519674893
Cabin data type is object
Embarked data type is object

# Steps to Interact with a CSV File (Pandas)

---

## 1. Read the CSV File
- Load the CSV data into the system

---

## 2. Understand the Dataset
- Check number of rows and columns
- Review column names
- Get a high-level overview of the data

---

## 3. Check for Duplicate Records
- Identify duplicate rows
- Count total duplicates
- Remove duplicates if required

---

## 4. Identify Column-wise Data Types
- Understand which columns are numeric, categorical, or date-based

---

## 5. Check for Missing Values
- Identify columns with null or missing data

---

## 6. Handle Missing Values
- Decide whether to fill or remove missing values

---

## 7. Analyze Data Distribution (Numeric Columns Only)
- Understand data spread
- Check skewness and central tendency

---

## 8. Detect Outliers
- Identify extreme or abnormal values

---

## 9. Correct or Convert Data Types
- Convert columns to appropriate data types if needed

---

## 10. Feature Engineering
- Create new meaningful columns from existing data

---

## 11. Analyze Categorical Data
- Study frequency and category-level patterns

---

## 12. Correlation Analysis
- Identify relationships between numeric columns

---

## 13. Data Validation
- Ensure data quality and consistency

---

## 14. Prepare Data for Analytics or ML
- Separate features and target variables

---

## 15. Save the Cleaned Dataset
- Export the final cleaned data for further use

---

## Final Note
> These steps form a standard data-cleaning and preparation workflow used in real-world data projects.

In [ ]:
# find null isnull only provides Boolean
titanicDataSet.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [ ]:
# find null isnull only provides numerical value each column
titanicDataSet.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [29]:
percentageCalcullate = len(titanicDataSet) / 2

print(percentageCalcullate)

445.5

In [58]:
for index in range(len(columnsList)):
    column = columnsList[index]

    if titanicDataSet[column].isnull().sum() > percentageCalcullate :
        print(f"{column} have more than {percentageCalcullate} null values {titanicDataSet[column].dtype} ")
    else:
        print(f"{column} have less than {percentageCalcullate} null values {titanicDataSet[column].dtype} ")

PassengerId have less than 445.5 null values int64
Survived have less than 445.5 null values int64
Pclass have less than 445.5 null values int64
Name have less than 445.5 null values object
Sex have less than 445.5 null values object
Age have less than 445.5 null values float64
SibSp have less than 445.5 null values int64
Parch have less than 445.5 null values int64
Ticket have less than 445.5 null values object
Fare have less than 445.5 null values float64
Cabin have more than 445.5 null values object
Embarked have less than 445.5 null values object

In [ ]:
# we have minimal amount of null values in the age column (float64)
# so we can replace the null values with the mean

titanicDataSet["Age"] = titanicDataSet["Age"].fillna(titanicDataSet["Age"].mean())

titanicDataSet.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [59]:
# we more than 50% of the null values in the cabin column
# so we can drop the column

# why inplace?
# inplace=True means that the changes will be made to the original dataframe
titanicDataSet.drop("Cabin", axis=1, inplace=True)

titanicDataSet.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [61]:
# still we have null in Embarked
# we can replace the null values with the median


# why median?
# because Embarked data type is object
titanicDataSet["Embarked"] = titanicDataSet["Embarked"].fillna("Unknown")

In [62]:
titanicDataSet.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [81]:
# Detect and handle outliers using IQR (Interquartile Range)

# What is Quantile?
# Quantiles help us understand how the data is distributed.
# They split the data into equal parts.
# Example: Q1 is the 25% mark, Q3 is the 75% mark.

# Why Quantile?
# Quantile is used to find the values at specific percentages of the data.
# It helps us understand spread and detect outliers.

# Why Interquartile Range (IQR)?
# IQR measures the middle 50% of the data.
# It is used to detect outliers because it is not affected by extreme values.

# Q1 (25%) is the value below which 25% of data lies.
# Q3 (75%) is the value below which 75% of data lies.
# IQR = Q3 - Q1 (the middle spread of the data)

for col in columnsList:

    # Skip the column if it does not exist in the dataset
    if col not in titanicDataSet.columns:
        continue

    # Apply IQR only on numeric columns (int or float)
    if titanicDataSet[col].dtype != "object":

        # Calculate Q1 and Q3
        q1 = titanicDataSet[col].quantile(0.25)
        q3 = titanicDataSet[col].quantile(0.75)

        # Calculate IQR
        iqr = q3 - q1

        # Define outlier boundaries
        lower_bound = q1 - 1.5 * iqr
        upper_bound = q3 + 1.5 * iqr

        # Filter out the outliers
        outliers = titanicDataSet[
            (titanicDataSet[col] < lower_bound) |
            (titanicDataSet[col] > upper_bound)
        ]

        # Why clip?
        # Clip is used to limit values within the boundary.
        # This replaces outliers with the nearest valid value.
        # It helps in keeping the data within a safe range without dropping rows.
        titanicDataSet[col] = titanicDataSet[col].clip(lower=lower_bound, upper=upper_bound)

        # Print the number of outliers found in this column
        print(f"{col} -> Outliers count: {outliers.shape[0]}")

PassengerId -> Outliers count: 0
Survived -> Outliers count: 0
Pclass -> Outliers count: 0
Age -> Outliers count: 0
SibSp -> Outliers count: 0
Parch -> Outliers count: 0
Fare -> Outliers count: 0